УТ/src/Documents/АУ_ПланБюджета/АУ_ПланБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АУ_ПланБюджета</name>
  <registerRecords>AccumulationRegister.АУ_ПланФактБюджета</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Месяц</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СтатьиБюджета</name>
    <attributes>
      <name>СтатьяБюджета</name>
      <type>
        <types>CatalogRef.АУ_СтатьиБюджета</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ/src/AccumulationRegisters/АУ_ПланФактБюджета/АУ_ПланФактБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>АУ_ПланФактБюджета</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаПлан</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаФакт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяБюджета</name>
    <type>
      <types>CatalogRef.АУ_СтатьиБюджета</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УТ/src/Documents/АУ_ПланБюджета/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.АУ_ПланФактБюджета.Записывать = Истина;
	
	Для Каждого ТекСтрокаСтатьиБюджета Из СтатьиБюджета Цикл
		
		Движение = Движения.АУ_ПланФактБюджета.Добавить();
		Движение.Период = НачалоМесяца(Месяц);
		Движение.Организация = Организация;
		Движение.СтатьяБюджета = ТекСтрокаСтатьиБюджета.СтатьяБюджета;
		Движение.СуммаПлан = ТекСтрокаСтатьиБюджета.Сумма;
		
	КонецЦикла;

КонецПроцедуры
